# UIThemeManager Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIThemeManager Class
Members See Also
---
Manager object for the UITheme class.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static class UIThemeManager
```

Visual Basic
---
```text
Public NotInheritable Class UIThemeManager
```

Visual C++
---
```text
public ref class UIThemeManager abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..UIThemeManager
# See Also
UIThemeManager Members
Autodesk.Revit.UI Namespace